micropython/micropython/stmhal/hal/l4/src/stm32l4xx_hal_uart.c
  if((huart->State == HAL_UART_STATE_BUSY_RX) || (huart->State == HAL_UART_STATE_BUSY_TX_RX))
  {

    if ((huart->Init.WordLength == UART_WORDLENGTH_9B) && (huart->Init.Parity == UART_PARITY_NONE))
    {
      tmp = (uint16_t*) huart->pRxBuffPtr ;
      *tmp = (uint16_t)(huart->Instance->RDR & uhMask);
      huart->pRxBuffPtr +=2;
    }
    else
    {
      *huart->pRxBuffPtr++ = (uint8_t)(huart->Instance->RDR & (uint8_t)uhMask);
    }

    if(--huart->RxXferCount == 0)
    {
      __HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);

      /* Check if a transmit Process is ongoing or not */
      if(huart->State == HAL_UART_STATE_BUSY_TX_RX)
      {
        huart->State = HAL_UART_STATE_BUSY_TX;
      }
      else
      {
        /* Disable the UART Parity Error Interrupt */
        __HAL_UART_DISABLE_IT(huart, UART_IT_PE);

        /* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
        __HAL_UART_DISABLE_IT(huart, UART_IT_ERR);

        huart->State = HAL_UART_STATE_READY;
      }

      HAL_UART_RxCpltCallback(huart);

      return HAL_OK;
    }

    return HAL_OK;
  }
  else
  {
    /* Clear RXNE interrupt flag */
    __HAL_UART_SEND_REQ(huart, UART_RXDATA_FLUSH_REQUEST);

    return HAL_BUSY;
  }
}


/**
  * @brief Calculate register BRR value without using uint64.
  * @note   This function is added by the micropython project.
  * @param  fck: Input clock frequency to the uart block in Hz.
  * @param  baud: baud rate should be one of {300, 600, 1200, 2400, 4800, 9600, 19200, 57600, 115200}.
  * @retval BRR value
  */
uint32_t HAL_UART_CalcBrr(uint32_t fck, uint32_t baud)
{
    const struct
    {
        uint32_t limit;
        uint32_t div;
    } comDiv[]= {
        {1<<31, 300 }, /* must by >= 256 */
        {1<<30, 150 }, /* must by >= 128 */
        {1<<29,  75 }, /* must by >= 64 */
        {1<<28,  50 }, /* must by >= 32 */
        {1<<27,  20 }, /* must by >= 16 */
        {1<<26,  10 }, /* must by >= 8 */
        {1<<25,   5 }, /* must by >= 4 */
        {1<<24,   2 }  /* must by >= 2 */
    };
    const uint32_t comDivCnt = sizeof(comDiv)/sizeof(comDiv[0]);
    uint8_t i;
    for (i=0; i<comDivCnt ;i++)
    {
        if (fck >= comDiv[i].limit)
        {
            fck  /= comDiv[i].div;
            baud /= comDiv[i].div;
            break;
        }
    }
    return (fck<<8)/baud;
}

/**
  * @}
  */

#endif /* HAL_UART_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
